{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "eccf4719",
   "metadata": {},
   "source": [
    "# Project 3, Part 3, Create graph 1 database in Neo4j, Year 2020\n",
    "## Graph 1: one-way relationships from coo (country of origin) to coa (country of asylum)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a78e9633",
   "metadata": {},
   "source": [
    "## Included Modules and Packages"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "cd1b6aa0",
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4j\n",
    "\n",
    "import csv\n",
    "\n",
    "import math\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "\n",
    "import psycopg2"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6669be87",
   "metadata": {},
   "source": [
    "## Supporting code"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "f5f22363",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = neo4j.GraphDatabase.driver(uri=\"neo4j://neo4j:7687\", auth=(\"neo4j\",\"ucb_mids_w205\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "34a0561d",
   "metadata": {},
   "outputs": [],
   "source": [
    "session = driver.session(database=\"neo4j\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "3ebf5fc6",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_wipe_out_database():\n",
    "    \"wipe out database by deleting all nodes and relationships\"\n",
    "    \n",
    "    query = \"match (node)-[relationship]->() delete node, relationship\"\n",
    "    session.run(query)\n",
    "    \n",
    "    query = \"match (node) delete node\"\n",
    "    session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "92c31161",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_run_query_pandas(query, **kwargs):\n",
    "    \"run a query and return the results in a pandas dataframe\"\n",
    "    \n",
    "    result = session.run(query, **kwargs)\n",
    "    \n",
    "    df = pd.DataFrame([r.values() for r in result], columns=result.keys())\n",
    "    \n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "9cb76438",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_number_nodes_relationships():\n",
    "    \"print the number of nodes and relationships\"\n",
    "   \n",
    "    \n",
    "    query = \"\"\"\n",
    "        match (n) \n",
    "        return n.name as node_name, labels(n) as labels\n",
    "        order by n.name\n",
    "    \"\"\"\n",
    "    \n",
    "    df = my_neo4j_run_query_pandas(query)\n",
    "    \n",
    "    number_nodes = df.shape[0]\n",
    "    \n",
    "    \n",
    "    query = \"\"\"\n",
    "        match (n1)-[r]->(n2) \n",
    "        return n1.name as node_name_1, labels(n1) as node_1_labels, \n",
    "            type(r) as relationship_type, n2.name as node_name_2, labels(n2) as node_2_labels\n",
    "        order by node_name_1, node_name_2\n",
    "    \"\"\"\n",
    "    \n",
    "    df = my_neo4j_run_query_pandas(query)\n",
    "    \n",
    "    number_relationships = df.shape[0]\n",
    "    \n",
    "    print(\"-------------------------\")\n",
    "    print(\"  Nodes:\", number_nodes)\n",
    "    print(\"  Relationships:\", number_relationships)\n",
    "    print(\"-------------------------\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "25852f91",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_create_node(country_name):\n",
    "    \"create a node with label Country\"\n",
    "    \n",
    "    query = \"\"\"\n",
    "    \n",
    "    CREATE (:Country {name: $country_name})\n",
    "    \n",
    "    \"\"\"\n",
    "    \n",
    "    session.run(query, country_name=country_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "45a248a0",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_create_relationship_one_way(from_country, to_country, weight):\n",
    "    \"create a relationship one way between two countries with a weight\"\n",
    "    \n",
    "    query = \"\"\"\n",
    "    \n",
    "    MATCH (from:Country), \n",
    "          (to:Country)\n",
    "    WHERE from.name = $from_country and to.name = $to_country\n",
    "    CREATE (from)-[:LINK {weight: $weight}]->(to)\n",
    "    \n",
    "    \"\"\"\n",
    "    \n",
    "    session.run(query, from_country=from_country, to_country=to_country, weight=weight)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "78e1a838",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_create_relationship_two_way(from_country, to_country, weight):\n",
    "    \"create relationships two way between two countries with a weight\"\n",
    "    \n",
    "    query = \"\"\"\n",
    "    \n",
    "    MATCH (from:Country), \n",
    "          (to:Country)\n",
    "    WHERE from.name = $from_country and to.name = $to_country\n",
    "    CREATE (from)-[:LINK {weight: $weight}]->(to),\n",
    "           (to)-[:LINK {weight: $weight}]->(from)\n",
    "    \n",
    "    \"\"\"\n",
    "    \n",
    "    session.run(query, from_country=from_country, to_country=to_country, weight=weight)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "5754282a",
   "metadata": {},
   "outputs": [],
   "source": [
    "connection = psycopg2.connect(\n",
    "    user = \"postgres\",\n",
    "    password = \"ucb\",\n",
    "    host = \"postgres\",\n",
    "    port = \"5432\",\n",
    "    database = \"postgres\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "4167ddca",
   "metadata": {},
   "outputs": [],
   "source": [
    "cursor = connection.cursor()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4ee3152d",
   "metadata": {},
   "source": [
    "## 3.3.1 Wipe out the Neo4j database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "4a01d877",
   "metadata": {},
   "outputs": [],
   "source": [
    "my_neo4j_wipe_out_database()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "10516015",
   "metadata": {},
   "source": [
    "## 3.3.2 Verify the number of nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "7e458073",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 0\n",
      "  Relationships: 0\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "my_neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2150406c",
   "metadata": {},
   "source": [
    "## 3.3.3 Query list of countries and create the emigration and immigration nodes in the graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "e8cfeec7",
   "metadata": {},
   "outputs": [],
   "source": [
    "connection.rollback()\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "(select coo as country\n",
    "from stage_1_refugees)\n",
    "union\n",
    "(select coa as country\n",
    "from stage_1_refugees)\n",
    "order by country\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "cursor.execute(query)\n",
    "\n",
    "connection.rollback()\n",
    "\n",
    "rows = cursor.fetchall()\n",
    "\n",
    "for row in rows:\n",
    "    \n",
    "    country = row[0]\n",
    "    \n",
    "    my_neo4j_create_node(country)\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1282662c",
   "metadata": {},
   "source": [
    "## 3.3.4 Verify the number of nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "30f407df",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 212\n",
      "  Relationships: 0\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "my_neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "778ae301",
   "metadata": {},
   "source": [
    "## 3.3.5 Query the list of all possible refugee movements and number of refugees for a particular year, create a relationship for each movement with number of refugees as the weight\n",
    "\n",
    "- One way relationship: from `the country the refugees are emigrating from` to `the country the refugees are immigrating to`\n",
    "- The weight of the relationship: the number of refugees\n",
    "- Year: 2020"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "9a1408ff",
   "metadata": {},
   "outputs": [],
   "source": [
    "connection.rollback()\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "select coo as from_country,\n",
    "       coa as to_country,\n",
    "       refugees\n",
    "from stage_1_refugees\n",
    "where (coo <> coa) and (refugees::numeric > 0) and (year::numeric = 2020)\n",
    "order by coo, coa, refugees\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "cursor.execute(query)\n",
    "\n",
    "connection.rollback()\n",
    "\n",
    "rows = cursor.fetchall()\n",
    "\n",
    "for row in rows:\n",
    "    \n",
    "    coo = row[0]\n",
    "    coa = row[1]\n",
    "    refugees = int(row[2])\n",
    "    \n",
    "    my_neo4j_create_relationship_one_way(coo, coa, refugees)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "24b2301e",
   "metadata": {},
   "source": [
    "## 3.3.6 Verify the number of nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "6ea03800",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 212\n",
      "  Relationships: 4227\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "my_neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b467d4b8",
   "metadata": {},
   "source": [
    "## 3.3.7 PageRank algorithm\n",
    "\n",
    "**What are the most influential countries in granting asylum?**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "ad3435f1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f1bf1616850>"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('ds_graph', 'Country', 'LINK', {relationshipProperties: 'weight'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "c1d1f47f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>page_rank</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>USA</td>\n",
       "      <td>2.166033</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>GFR</td>\n",
       "      <td>1.786840</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>CAN</td>\n",
       "      <td>1.710052</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>GBR</td>\n",
       "      <td>1.608816</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>AUL</td>\n",
       "      <td>1.452053</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>207</th>\n",
       "      <td>VAN</td>\n",
       "      <td>0.950000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>208</th>\n",
       "      <td>VAT</td>\n",
       "      <td>0.950000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>209</th>\n",
       "      <td>VCT</td>\n",
       "      <td>0.950000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>210</th>\n",
       "      <td>WES</td>\n",
       "      <td>0.950000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>211</th>\n",
       "      <td>WSH</td>\n",
       "      <td>0.950000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>212 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    name  page_rank\n",
       "0    USA   2.166033\n",
       "1    GFR   1.786840\n",
       "2    CAN   1.710052\n",
       "3    GBR   1.608816\n",
       "4    AUL   1.452053\n",
       "..   ...        ...\n",
       "207  VAN   0.950000\n",
       "208  VAT   0.950000\n",
       "209  VCT   0.950000\n",
       "210  WES   0.950000\n",
       "211  WSH   0.950000\n",
       "\n",
       "[212 rows x 2 columns]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "CALL gds.pageRank.stream('ds_graph',\n",
    "                         { maxIterations: $max_iterations,\n",
    "                           dampingFactor: $damping_factor}\n",
    "                         )\n",
    "YIELD nodeId, score\n",
    "RETURN gds.util.asNode(nodeId).name AS name, score as page_rank\n",
    "ORDER BY page_rank DESC, name ASC\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "max_iterations = 20\n",
    "damping_factor = 0.05\n",
    "\n",
    "my_neo4j_run_query_pandas(query, max_iterations=max_iterations, damping_factor=damping_factor)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9632f00e",
   "metadata": {},
   "source": [
    "## 3.3.8 Personalized PageRank"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "e4d474d3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f1bf17f9370>"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('ds_graph', 'Country', 'LINK', {relationshipProperties: 'weight'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "282fb0d5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>page_rank</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>USA</td>\n",
       "      <td>0.267864</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>GFR</td>\n",
       "      <td>0.116882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>AUL</td>\n",
       "      <td>0.055153</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>GBR</td>\n",
       "      <td>0.048547</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SWE</td>\n",
       "      <td>0.037730</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>207</th>\n",
       "      <td>VAN</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>208</th>\n",
       "      <td>VAT</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>209</th>\n",
       "      <td>VCT</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>210</th>\n",
       "      <td>WES</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>211</th>\n",
       "      <td>WSH</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>212 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    name  page_rank\n",
       "0    USA   0.267864\n",
       "1    GFR   0.116882\n",
       "2    AUL   0.055153\n",
       "3    GBR   0.048547\n",
       "4    SWE   0.037730\n",
       "..   ...        ...\n",
       "207  VAN   0.000000\n",
       "208  VAT   0.000000\n",
       "209  VCT   0.000000\n",
       "210  WES   0.000000\n",
       "211  WSH   0.000000\n",
       "\n",
       "[212 rows x 2 columns]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (siteA:Country {name: $source})\n",
    "CALL gds.pageRank.stream('ds_graph', {\n",
    "  maxIterations: $max_iterations,\n",
    "  dampingFactor: $damping_factor,\n",
    "  sourceNodes: [siteA]\n",
    "})\n",
    "YIELD nodeId, score\n",
    "RETURN gds.util.asNode(nodeId).name AS name, score as page_rank\n",
    "ORDER BY score DESC, name ASC\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"USA\"\n",
    "max_iterations = 20\n",
    "damping_factor = 0.85\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, max_iterations=max_iterations, damping_factor=damping_factor)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0c641490",
   "metadata": {},
   "source": [
    "## 3.3.9 Harmonic centrality algorithm"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "903c9748",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f1bf17f9700>"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('ds_graph', 'Country', 'LINK', {relationshipProperties: 'weight'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "453ed2dd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>country</th>\n",
       "      <th>closeness</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>USA</td>\n",
       "      <td>0.845972</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>GFR</td>\n",
       "      <td>0.803318</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>CAN</td>\n",
       "      <td>0.776461</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>GBR</td>\n",
       "      <td>0.760664</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>FRA</td>\n",
       "      <td>0.736967</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>207</th>\n",
       "      <td>SXM</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>208</th>\n",
       "      <td>MNG</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>209</th>\n",
       "      <td>TIB</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>210</th>\n",
       "      <td>MSR</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>211</th>\n",
       "      <td>MYA</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>212 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    country  closeness\n",
       "0       USA   0.845972\n",
       "1       GFR   0.803318\n",
       "2       CAN   0.776461\n",
       "3       GBR   0.760664\n",
       "4       FRA   0.736967\n",
       "..      ...        ...\n",
       "207     SXM   0.000000\n",
       "208     MNG   0.000000\n",
       "209     TIB   0.000000\n",
       "210     MSR   0.000000\n",
       "211     MYA   0.000000\n",
       "\n",
       "[212 rows x 2 columns]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "CALL gds.closeness.harmonic.stream('ds_graph', {})\n",
    "YIELD nodeId, score\n",
    "RETURN gds.util.asNode(nodeId).name AS country, score as closeness\n",
    "ORDER BY closeness DESC\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0dd9f0b3",
   "metadata": {},
   "source": [
    "## 3.3.10 Louvain modularity algorithm"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "70fd5a97",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f1bf183fdf0>"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "CALL gds.graph.project('ds_graph', 'Country', 'LINK', \n",
    "                      {relationshipProperties: 'weight'})\n",
    "\"\"\"\n",
    "\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "d2d34576",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>country</th>\n",
       "      <th>community</th>\n",
       "      <th>intermediate_community</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TUV</td>\n",
       "      <td>6</td>\n",
       "      <td>[6, 6, 6, 6]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>VAN</td>\n",
       "      <td>14</td>\n",
       "      <td>[14, 14, 14, 14]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>VAT</td>\n",
       "      <td>15</td>\n",
       "      <td>[15, 15, 15, 15]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>WES</td>\n",
       "      <td>18</td>\n",
       "      <td>[18, 18, 18, 18]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ABW</td>\n",
       "      <td>35</td>\n",
       "      <td>[35, 35, 35, 35]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>207</th>\n",
       "      <td>YEM</td>\n",
       "      <td>187</td>\n",
       "      <td>[12, 112, 176, 187]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>208</th>\n",
       "      <td>ZAM</td>\n",
       "      <td>187</td>\n",
       "      <td>[120, 98, 176, 187]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>209</th>\n",
       "      <td>ZIM</td>\n",
       "      <td>187</td>\n",
       "      <td>[120, 98, 176, 187]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>210</th>\n",
       "      <td>SXM</td>\n",
       "      <td>193</td>\n",
       "      <td>[193, 193, 193, 193]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>211</th>\n",
       "      <td>MSR</td>\n",
       "      <td>206</td>\n",
       "      <td>[206, 206, 206, 206]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>212 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    country  community intermediate_community\n",
       "0       TUV          6           [6, 6, 6, 6]\n",
       "1       VAN         14       [14, 14, 14, 14]\n",
       "2       VAT         15       [15, 15, 15, 15]\n",
       "3       WES         18       [18, 18, 18, 18]\n",
       "4       ABW         35       [35, 35, 35, 35]\n",
       "..      ...        ...                    ...\n",
       "207     YEM        187    [12, 112, 176, 187]\n",
       "208     ZAM        187    [120, 98, 176, 187]\n",
       "209     ZIM        187    [120, 98, 176, 187]\n",
       "210     SXM        193   [193, 193, 193, 193]\n",
       "211     MSR        206   [206, 206, 206, 206]\n",
       "\n",
       "[212 rows x 3 columns]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "CALL gds.louvain.stream('ds_graph', {includeIntermediateCommunities: true})\n",
    "YIELD nodeId, communityId, intermediateCommunityIds\n",
    "RETURN gds.util.asNode(nodeId).name AS country, communityId as community, intermediateCommunityIds as intermediate_community\n",
    "ORDER BY community, country ASC\n",
    "\"\"\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query)\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
